#### ✅ Terraform Format and Style 🖌
#### ✅ Terraform Initialization ⚙️
#### ✅ Terraform Validation 🤖
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### ✅ Terraform Plan 📖

<details><summary>Show Plan</summary>

```
random_password.certificate-password: Refreshing state... [id=none]
tls_private_key.private_key: Refreshing state... [id=e02215b4a26f6411d46c394957a920ba15244fd6]
acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/1611596407]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter]
azurerm_log_analytics_workspace.log-analytics-workspace: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.OperationalInsights/workspaces/log-otter-log-analytics-workspace]
azurerm_dns_zone.sample-domain: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk]
azurerm_cosmosdb_account.db: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.DocumentDB/databaseAccounts/log-otter-samples]
acme_certificate.certificate: Refreshing state... [id=213bf674-9d40-8dc5-e4d7-19f16ff4b274]
azurerm_container_app_environment.container-app-environment: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment]
azurerm_application_insights.app-insights: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Insights/components/log-otter-app-insights]
azurerm_dns_a_record.admin: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/A/admin]
azurerm_dns_a_record.api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/A/api]
azurerm_container_app_environment_certificate.container-app-certificate: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate]
azurerm_dns_a_record.root: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/A/@]
azurerm_container_app.ingress: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress]
azurerm_container_app.customer-api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-api]
azurerm_container_app.hub: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/hub]
azurerm_container_app.customer-worker: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-worker]
azurerm_dns_txt_record.api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/TXT/asuid.api]
azurerm_dns_txt_record.admin: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/TXT/asuid.admin]
azurerm_container_app_custom_domain.root: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/sample.logotter.co.uk.]
azurerm_container_app_custom_domain.api: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/api.sample.logotter.co.uk.]
azurerm_dns_txt_record.root: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.Network/dnsZones/sample.logotter.co.uk/TXT/asuid]
azurerm_container_app_custom_domain.admin: Refreshing state... [id=/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/admin.sample.logotter.co.uk.]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # acme_certificate.certificate must be replaced
-/+ resource "acme_certificate" "certificate" {
      ~ certificate_domain            = "sample.logotter.co.uk" -> (known after apply)
      ~ certificate_not_after         = "2024-06-08T15:11:29Z" -> (known after apply)
      ~ certificate_p12               = (sensitive value)
      ~ certificate_pem               = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFDzCCA/egAwIBAgISBCht7dskj3gUDVxR5sISa6i3MA0GCSqGSIb3DQEBCwUA
            MDIxCzAJBgNVBAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MQswCQYDVQQD
            EwJSMzAeFw0yNDAzMTAxNTExMzBaFw0yNDA2MDgxNTExMjlaMCAxHjAcBgNVBAMT
            FXNhbXBsZS5sb2dvdHRlci5jby51azCCASIwDQYJKoZIhvcNAQEBBQADggEPADCC
            AQoCggEBAPkZyYaTGPL4SnWIZhiSoQHGwM1iu+zyCMYFtr5d84+BqB+VMW+wDVvs
            SwBhAQVoUochvAQmDe1BG8b5wiVVdTibPzLGYJMeJhcQHVgQcItpd0pcWKlvH1ls
            JqQ2h8uXcqehVHY0+rvud0Q+pShXUwi31tTpZmaPKuOWQseNb2kczWkJzLSVlhkS
            eexJ6zw/uvSm4V3N9UUuOZaBp4kM3fbgG5F24S1vHqsz1ORNdSYjZCUvuxvbD20W
            LbgkyCeKlpZ4dNXBRUEAdQo0M/VnWhd5IPlxW61OGGrDYjLnhoqbUXjUS+9pm/se
            e5ildEtjIw8+mUxbfn90Spt936n1Na8CAwEAAaOCAi8wggIrMA4GA1UdDwEB/wQE
            AwIFoDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0TAQH/BAIw
            ADAdBgNVHQ4EFgQUYbF3vTOOXAtFWwtvQwZLFFyMOuwwHwYDVR0jBBgwFoAUFC6z
            F7dYVsuuUAlA5h+vnYsUwsYwVQYIKwYBBQUHAQEESTBHMCEGCCsGAQUFBzABhhVo
            dHRwOi8vcjMuby5sZW5jci5vcmcwIgYIKwYBBQUHMAKGFmh0dHA6Ly9yMy5pLmxl
            bmNyLm9yZy8wOQYDVR0RBDIwMIIXKi5zYW1wbGUubG9nb3R0ZXIuY28udWuCFXNh
            bXBsZS5sb2dvdHRlci5jby51azATBgNVHSAEDDAKMAgGBmeBDAECATCCAQMGCisG
            AQQB1nkCBAIEgfQEgfEA7wB2ADtTd3U+LbmAToswWwb+QDtn2E/D9Me9AA0tcm/h
            +tQXAAABjikiMkkAAAQDAEcwRQIgbB/goM9sf8/uiUVTh9+/V2IfwcU7JE++a5Ze
            Y6L+ldMCIQDapGTU4JqrSkmrsLSPdN7/e0IlJVXMSde5WN2LSaJ3CQB1AKLiv9Ye
            3i8vB6DWTm03p9xlQ7DGtS6i2reK+Jpt9RfYAAABjikiMk8AAAQDAEYwRAIgLYK9
            VlKAb2XxpORv6nW+EiAPz87aPDhopECAXeHOOv0CIGhEOy9IuGaJlNXEsQQxHLz4
            zuOrYgO4Xf0yEZiT/7ewMA0GCSqGSIb3DQEBCwUAA4IBAQAg5SAsG3aKtFM9CznL
            zkXua3XnNe04T+nra3XCbMcmTeJOI4QjCS/oAWKw7jFO+VeRWlrp1olCUE22YrXF
            VpmT46gCssgrZ5G3OgTL5RSg3YPqkg3sR0KIstiZEKkdWrgCj31ix+S4A6+2vXrr
            T5sNZJhzLgEABdH++DWNksWm6+7zS7roTu2LXmkoyP/RJLudZD8BEgFsFFlFFlDo
            4nbLm3C/KGJwdE3gS/gONd/4suTl90HcQTfliOQQ7Y7CBX+UhHYJlWilJgGMzBhv
            CWp6BTwf7bzKkfnZ8Fxw0ZhrV57IHSVvd8UjyqG78y7U3zFv3ntkC6X66vqxDT/6
            Vv1n
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ certificate_url               = "https://acme-v02.api.letsencrypt.org/acme/cert/04286deddb248f78140d5c51e6c2126ba8b7" -> (known after apply)
      ~ common_name                   = "sample.logotter.co.uk" -> "*.sample.logotter.co.uk" # forces replacement
      ~ id                            = "213bf674-9d40-8dc5-e4d7-19f16ff4b274" -> (known after apply)
      ~ issuer_pem                    = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFFjCCAv6gAwIBAgIRAJErCErPDBinU/bWLiWnX1owDQYJKoZIhvcNAQELBQAw
            TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh
            cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMjAwOTA0MDAwMDAw
            WhcNMjUwOTE1MTYwMDAwWjAyMQswCQYDVQQGEwJVUzEWMBQGA1UEChMNTGV0J3Mg
            RW5jcnlwdDELMAkGA1UEAxMCUjMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK
            AoIBAQC7AhUozPaglNMPEuyNVZLD+ILxmaZ6QoinXSaqtSu5xUyxr45r+XXIo9cP
            R5QUVTVXjJ6oojkZ9YI8QqlObvU7wy7bjcCwXPNZOOftz2nwWgsbvsCUJCWH+jdx
            sxPnHKzhm+/b5DtFUkWWqcFTzjTIUu61ru2P3mBw4qVUq7ZtDpelQDRrK9O8Zutm
            NHz6a4uPVymZ+DAXXbpyb/uBxa3Shlg9F8fnCbvxK/eG3MHacV3URuPMrSXBiLxg
            Z3Vms/EY96Jc5lP/Ooi2R6X/ExjqmAl3P51T+c8B5fWmcBcUr2Ok/5mzk53cU6cG
            /kiFHaFpriV1uxPMUgP17VGhi9sVAgMBAAGjggEIMIIBBDAOBgNVHQ8BAf8EBAMC
            AYYwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMBIGA1UdEwEB/wQIMAYB
            Af8CAQAwHQYDVR0OBBYEFBQusxe3WFbLrlAJQOYfr52LFMLGMB8GA1UdIwQYMBaA
            FHm0WeZ7tuXkAXOACIjIGlj26ZtuMDIGCCsGAQUFBwEBBCYwJDAiBggrBgEFBQcw
            AoYWaHR0cDovL3gxLmkubGVuY3Iub3JnLzAnBgNVHR8EIDAeMBygGqAYhhZodHRw
            Oi8veDEuYy5sZW5jci5vcmcvMCIGA1UdIAQbMBkwCAYGZ4EMAQIBMA0GCysGAQQB
            gt8TAQEBMA0GCSqGSIb3DQEBCwUAA4ICAQCFyk5HPqP3hUSFvNVneLKYY611TR6W
            PTNlclQtgaDqw+34IL9fzLdwALduO/ZelN7kIJ+m74uyA+eitRY8kc607TkC53wl
            ikfmZW4/RvTZ8M6UK+5UzhK8jCdLuMGYL6KvzXGRSgi3yLgjewQtCPkIVz6D2QQz
            CkcheAmCJ8MqyJu5zlzyZMjAvnnAT45tRAxekrsu94sQ4egdRCnbWSDtY7kh+BIm
            lJNXoB1lBMEKIq4QDUOXoRgffuDghje1WrG9ML+Hbisq/yFOGwXD9RiX8F6sw6W4
            avAuvDszue5L3sz85K+EC4Y/wFVDNvZo4TYXao6Z0f+lQKc0t8DQYzk1OXVu8rp2
            yJMC6alLbBfODALZvYH7n7do1AZls4I9d1P4jnkDrQoxB3UqQ9hVl3LEKQ73xF1O
            yK5GhDDX8oVfGKF5u+decIsH4YaTw7mP3GFxJSqv3+0lUFJoi5Lc5da149p90Ids
            hCExroL1+7mryIkXPeFM5TgO9r0rvZaBFOvV2z0gp35Z0+L4WPlbuEjN/lxPFin+
            HlUjr8gRsI3qfJOQFy/9rKIJR0Y/8Omwt/8oTWgy1mdeHmmjk7j1nYsvC9JSQ6Zv
            MldlTTKB3zhThV1+XWYp6rjd5JW1zbVWEkLNxE7GJThEUG3szgBVGP7pSWTUTsqX
            nLRbwHOoq7hHwg==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ private_key_pem               = (sensitive value)
      ~ subject_alternative_names     = [ # forces replacement
          - "*.sample.logotter.co.uk",
          + "sample.logotter.co.uk",
        ]
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_container_app.customer-api will be updated in-place
  ~ resource "azurerm_container_app" "customer-api" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-api"
        name                          = "customer-api"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/customer-api:0.1.86" -> "ghcr.io/logotter/customer-api:"
                name              = "customer-api"
                # (5 unchanged attributes hidden)

                # (6 unchanged blocks hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app.customer-worker will be updated in-place
  ~ resource "azurerm_container_app" "customer-worker" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/customer-worker"
        name                          = "customer-worker"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/customer-worker:0.1.86" -> "ghcr.io/logotter/customer-worker:"
                name              = "customer-worker"
                # (5 unchanged attributes hidden)

                # (4 unchanged blocks hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_container_app.hub will be updated in-place
  ~ resource "azurerm_container_app" "hub" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/hub"
        name                          = "hub"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/hub:0.1.86" -> "ghcr.io/logotter/hub:"
                name              = "hub"
                # (5 unchanged attributes hidden)

                # (6 unchanged blocks hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app.ingress will be updated in-place
  ~ resource "azurerm_container_app" "ingress" {
        id                            = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress"
        name                          = "ingress"
        tags                          = {}
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/logotter/ingress:0.1.86" -> "ghcr.io/logotter/ingress:"
                name              = "hub"
                # (5 unchanged attributes hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_container_app_custom_domain.admin must be replaced
-/+ resource "azurerm_container_app_custom_domain" "admin" {
      ~ container_app_environment_certificate_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate" # forces replacement -> (known after apply) # forces replacement
      ~ id                                       = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/admin.sample.logotter.co.uk." -> (known after apply)
        name                                     = "admin.sample.logotter.co.uk."
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_app_custom_domain.api must be replaced
-/+ resource "azurerm_container_app_custom_domain" "api" {
      ~ container_app_environment_certificate_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate" # forces replacement -> (known after apply) # forces replacement
      ~ id                                       = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/api.sample.logotter.co.uk." -> (known after apply)
        name                                     = "api.sample.logotter.co.uk."
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_app_custom_domain.root must be replaced
-/+ resource "azurerm_container_app_custom_domain" "root" {
      ~ container_app_environment_certificate_id = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate" # forces replacement -> (known after apply) # forces replacement
      ~ id                                       = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/containerApps/ingress/customDomainName/sample.logotter.co.uk." -> (known after apply)
        name                                     = "sample.logotter.co.uk."
        # (2 unchanged attributes hidden)
    }

  # azurerm_container_app_environment_certificate.container-app-certificate must be replaced
-/+ resource "azurerm_container_app_environment_certificate" "container-app-certificate" {
      ~ certificate_blob_base64      = (sensitive value) # forces replacement
      ~ expiration_date              = "2024-06-08T15:11:29" -> (known after apply)
      ~ id                           = "/subscriptions/f8d65b0d-53e8-48c4-87cf-3cf4ca474262/resourceGroups/LogOtter/providers/Microsoft.App/managedEnvironments/log-otter-sample-container-app-environment/certificates/wildcard-certificate" -> (known after apply)
      ~ issue_date                   = "2024-03-10T15:11:30" -> (known after apply)
      ~ issuer                       = "CN=R3, O=Let's Encrypt, C=US" -> (known after apply)
        name                         = "wildcard-certificate"
      ~ subject_name                 = "CN=sample.logotter.co.uk" -> (known after apply)
      - tags                         = {} -> null
      ~ thumbprint                   = "8BBBCA6608DA57728A88C5B8042AEA8C04E78DA6" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 4 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher:* @AButler
*Last Updated:* `2024-04-20T09:29:12.375Z`